Documents/ВводОстатковПоМагазину.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ВводОстатковПоМагазину</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>InformationRegister.ДокументыПродажи</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПродСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Взаиморасчеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КредДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНашДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНамДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоставки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Внутренний</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/ДокументыПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ДокументыПродажи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВводОстатковПоМагазину/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(отказ, режимПроведения)
	
	Проводки = Движения.Управленческий;
	ДокументыПродажи = Движения.ДокументыПродажи;
	

	// Товары в рознице
	НоваяПроводка = Проводки.Добавить();
	НоваяПроводка.Период		= Дата;
	НоваяПроводка.Подразделение	= Подразделение;
	НоваяПроводка.Отдел 		= Отдел;
	
	
	НоваяПроводка.СчетДт = ПланыСчетов.Внутренний.ТоварыВРознице;
	
	НоваяПроводка.СчетКт = ПланыСчетов.Внутренний.ПУСТО;
	
	НоваяПроводка.Сумма	= СуммаПродСтоимость;
	НоваяПроводка.Содержание	= "Товары в розн.: "+ СокрЛП(Магазин) + " / " + СокрЛП(Отдел);
	
	// Розничная наценка.
    НоваяПроводка = Проводки.Добавить();
	НоваяПроводка.Период		= Дата;
	НоваяПроводка.Подразделение = Подразделение;
	НоваяПроводка.Отдел 		= Отдел;
	
	НоваяПроводка.СчетДт = ПланыСчетов.Внутренний.ПУСТО;
	
	НоваяПроводка.СчетКт = ПланыСчетов.Внутренний.РозничнаяНаценкаБаза;
	
	НоваяПроводка.Сумма	= СуммаНаценка;
	НоваяПроводка.Содержание	= "Наценка: "+ СокрЛП(Магазин) + " / " + СокрЛП(Отдел);
	
	// Взаиморасчеты
	Для Каждого СтрокаВзаиморасчеты Из Взаиморасчеты Цикл
		
		НоваяПроводка = Проводки.Добавить();
		НоваяПроводка.Период		= Дата;
		НоваяПроводка.Подразделение = Подразделение;
		НоваяПроводка.Отдел 		= Отдел;
		
		НоваяПроводка.СчетДт = ПланыСчетов.Внутренний.ПУСТО;
		
		НоваяПроводка.СчетКт = ПланыСчетов.Внутренний.ПоставщикиБаза;
		НоваяПроводка.СубконтоКт.Контрагенты 		= СтрокаВзаиморасчеты.Контрагент;
		НоваяПроводка.СубконтоКт.ДокументПоставки 	= СтрокаВзаиморасчеты.ДокументПоставки;
		
		
		НоваяПроводка.Сумма	= СтрокаВзаиморасчеты.СуммаНашДолг - СтрокаВзаиморасчеты.СуммаНамДолг;
		НоваяПроводка.Содержание	= "Накладная: "+ СокрЛП(СтрокаВзаиморасчеты.ДокументПоставки) + "("+СокрЛП(Магазин) + " / " + СокрЛП(Отдел) + ")";
		
		// Документ продажи.
		Движение = ДокументыПродажи.Добавить();
		Движение.Подразделение = Подразделение;
		Движение.Контрагент = СтрокаВзаиморасчеты.Контрагент;
		Движение.НомерДокумента = СтрокаВзаиморасчеты.ДокументПоставки;
		Движение.ДатаДокумента = СтрокаВзаиморасчеты.ДатаДокумента;
		
		Движение.Магазин	= Магазин;
		Движение.Отдел		= Отдел;
		Движение.Сумма 		= СтрокаВзаиморасчеты.СуммаНашДолг - СтрокаВзаиморасчеты.СуммаНамДолг;
		
	КонецЦикла;
		
		
	Проводки.Записать();
	ДокументыПродажи.Записать();
	
	
КонецПроцедуры

Процедура ПередЗаписью(отказ, режимЗаписи, режимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Подразделение.Пустая() Тогда
		
		ТекстСообщения = НСтр("ru = 'Запись невозможна без заполнения Подразделения.'");
		ПроверкаДанныхКлиентСервер.СообщитьОбОшибке(отказ, текстСообщения, ЭтотОбъект, "Подразделение");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(объектКопирования)
	
	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеСкопированногоДокумента(ЭтотОбъект, объектКопирования);
	
КонецПроцедуры

#КонецОбласти
